# Задание №12
В задании 12 есть много разных типов задач, но самый распространённый из них - Исполнитель "Редактор" можно без особых проблем решить с помощью компьютера.

## Задание 12 Исполнитель "Редактор"
"Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.

А) заменить (v, w).

Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды

заменить (111, 27)

преобразует строку 05111150 в строку 0527150. Если в строке нет вхождений цепочки v, то выполнение команды заменить (v, w) не меняет эту строку.

Б) нашлось (v).

Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка

исполнителя при этом не изменяется.
Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из N идущих подряд цифр X? В ответе запишите полученную строку."

## Шаблон
```
n = N * "X" #создаем строку из N штук цифр X
#переписываем всю программу на Python
#при этом заменяем нашлось() на "" in n и заменить( , ) на n=n.replace( , , 1)
print(n) #если нужна в ответе полученная строка
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/8e9c5b22b6dd436d0a2f89499ba2432039202e38/templates/ex12-template.py)


## Примеры задач
### Задача 1 (https://kpolyakov.spb.ru/)
***
Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 68 идущих подряд цифр 8? В ответе запишите полученную строку.
***

```
 НАЧАЛО
 ПОКА нашлось (222) ИЛИ нашлось (888)
    ЕСЛИ нашлось (222)
        ТО заменить (222, 8)
        ИНАЧЕ заменить (888, 2)
    КОНЕЦ ЕСЛИ
 КОНЕЦ ПОКА
 КОНЕЦ
```

Решение:
```
n= 68 * "8"
while "222" in n or "888" in n:
  if "222" in n:
    n=n.replace("222", "8", 1)
  else: 
    n=n.replace("888", "2", 1)
print(n)
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/8e9c5b22b6dd436d0a2f89499ba2432039202e38/examples/ex12-example.py)

Программа выдаст 228288, это и есть ответ.

Ответ: 228288


## Примечания
- Пока нет
