# Задание №12
В задании 12 есть много разных типов задач, но самый распространённый из них - Исполнитель "Редактор" можно без особых проблем решить с помощью компьютера.

## Задание 12 Исполнитель "Редактор"
"Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.

А) заменить (v, w).

Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды

заменить (111, 27)

преобразует строку 05111150 в строку 0527150. Если в строке нет вхождений цепочки v, то выполнение команды заменить (v, w) не меняет эту строку.

Б) нашлось (v).

Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка

исполнителя при этом не изменяется.
Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из N идущих подряд цифр X? В ответе запишите полученную строку."

## Шаблон
```
for i in range(0,100000):
  # заменить int(input()) на i
  # заменить print(n) на if n==X: print(i)  
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/0f27397acd4e75f9544e7513e306687f83828b12/templates/ex6-template.py)


## Примеры задач
### Задача 1 (https://kpolyakov.spb.ru/)
***
Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 68 идущих подряд цифр 8? В ответе запишите полученную строку.
***

```
 НАЧАЛО
 ПОКА нашлось (222) ИЛИ нашлось (888)
    ЕСЛИ нашлось (222)
        ТО заменить (222, 8)
        ИНАЧЕ заменить (888, 2)
    КОНЕЦ ЕСЛИ
 КОНЕЦ ПОКА
 КОНЕЦ
```

Решение:
```
for i in range(0,10000):
  s = i
  n = 50
  while s > 0:
    s = s // 2
    n = n - 3
  if n==23: print(i)
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/42721e34caf021cc28af55110ce88da71076d984/examples/ex6-example.py)

Программа выдаст очень много значений, но нам нужно наименьшее, то есть самое первое - 256

Ответ:256


## Примечания
- Если программа не запускается, есть смысл попробовать перебрать числа наоборот (например, не от 1 до 1000, а от 1000 до 1). Для этого надо поменять местами диапазон в range и добавить -1 после запятой (пример: меняем range(0,1000) на range(1000,0,-1) )
- Чтобы не ставить отступы вручную, можно выделить весь текст и нажать Tab. Тогда весь выделенный текст переместится на отступ вправо.
