# Задание №14
Давайте рассмотрим одну из простых задач 14, на основе которой строятся почти все остальные типы задач 14.

## Задание 14 Исполнитель "Редактор"
"Значение арифметического выражения: (выражение) – записали в системе счисления с основанием I. Сколько цифр «N» содержится в этой записи?"

При переводе из десятичной системы счисления в любую другую мы делим это число на основание системы счисления и запоминаем остаток от деления каждый раз, после чего выставляем их с последнего до первого. Поэтому наша программа должна проверять остаток от деления (и подсчитывать сколько N попадается) и делить без остатка на I, переходя к следующему разряду.

## Шаблон
```
n = (выражение) #в ячейке n лежит вычисленное выражение
c=0 #счётчик, пригодится позже
while n>0:
  if n%I == N:
    c=c+1 #добавляем к счётчику 1, если остаток от деления на I равен N
  n=n//I
print(c) #выводит, сколько раз программа видела N
```

- Чтобы записать число возведённое в степень в Python, нужно поставить ** (например, 3 во второй степени это ```3**2``` в Python)

[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/8e9c5b22b6dd436d0a2f89499ba2432039202e38/templates/ex14-template.py)


## Примеры задач
### Задача 1 (9367 на РешуЕГЭ)
***
Значение арифметического выражения: 9^8 + 3^5 – 9 – записали в системе счисления с основанием 3. Сколько цифр «2» содержится в этой записи?
***

Решение:
```
n=9**8 + 3**5 - 9
c=0
while n>0:
  if n%3 == 2:
    c=c+1
  n=n//3
print(c)
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/8e9c5b22b6dd436d0a2f89499ba2432039202e38/examples/ex12-example.py)

Программа выдаст 3, это и есть ответ.

Ответ: 3


## Примечания
- 
