# Задание №16
Задание 16 предлагает нам поработать с функциями, а именно составить одну из них и найти её значение в конкретной точке или изменить уже заданную функцию 

## Задание 16 Составить функцию
"Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:
Чему равно значение функции F(N)?"

В данном типе заданий дается несколько условий, по которым действует алгоритм. Первые - при вводе конкретного числа, выводят другое (например, F(1)=2 выводит 2, если ввести 1), вторые - возвращают длинное выражение (с этой же функцией) при условии (пример F(n)= F(n-1) при n<10). Во втором часто происходит рекурсия, поэтому выполнить это задание вручную иногда невозможно, однако компьютер может запросто пересчитать все эти значения.

## Шаблон
```
def f(n):
  # заменяем условия типа F(1)=2 на if n==1: return 2
  # заменяем условия типа F(n)= F(n-1) при n<10 на if n>10: return F(n-1)
print(f(n)) # если в ответе нужно значение функции F(N)
```

[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/75a9354c493c21a3da27931b2fb8aae7747945df/templates/ex16-template.py)


## Примеры задач
### Задача 1 (4645 на РешуЕГЭ)
***
Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:

F(1) = 1

F(2) = 3

F(n) = F(n–1) * n + F(n–2) * (n – 1) , при n >2

Чему равно значение функции F(5)?
***

Решение:
```
def f(n):
  if n==1: return 1
  if n==2: return 3
  if n>2: return f(n-1) * n + f(n-2) * (n-1)
print(f(5))
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/066697ae0a2d75d216b0e4e543b11e91b93c5f7a/examples/ex16-example.py)

Программа выдаст 309, это и есть ответ.

Ответ: 309


## Примечания
- В Python заглавные и строчные буквы имеют большое значение, поэтому F(n) f(n) f(N) - это совершенно разные функции и переменные, поэтому алгоритм выдаст ошибку если напутать заглавные и строчные буквы
