# Задание №17
В задании 17 от нас требуется работа с текстовыми файлами, поиск нужной информации и её подсчёт. Это задание без компьютера сделать невозможно.
Нам дается текстовый файл .txt, в котором много чисел разделённых на строчки. Каждая строчка с числом называется "элементом последовательности" и ученику нужно исследовать пары этих элементов на определённое условие.

## Задание 17 Пары, идущие подряд
"В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от −10 000 до 10 000 включительно. Определите количество пар последовательности, {условие}. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности."

Первый тип данного задания включает в себя строчку "В данной задаче под парой подразумевается два идущих подряд элемента последовательности". Это значит, что тут парой мы считаем только те элементы, которые идут друг за другом (1-й и 2-й, 2-й и 3-й, 3-й и 4-й...). Поэтому программа будет такая:

## Шаблон
```
with open("17.txt", 'r') as f:
  a=[int(x) for x in f.read().splitlines()] 
#открыли файл и положили число из каждой строчки в массив a 
#(массив работает как переменная с номерными ячейками, обращение к одной из таких ячеек, в нашем случае, - a[номер ячейки])
с=0
m=0 #m=99999999 если в ответе нужна минимальная сумма элементов
for i in range(len(l) - 1):
    if #условие :
        c += 1
        m = max(m, l[i]+ l[i + 1]) #заменить max на min если в ответе нужна минимальная сумма элементов
print(c, m)
```

[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/75a9354c493c21a3da27931b2fb8aae7747945df/templates/ex16-template.py)

## Задание 17 Пары
"В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от −10 000 до 10 000 включительно. Определите количество пар последовательности, {условие}. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности."

Первый тип данного задания включает в себя строчку "В данной задаче под парой подразумевается два идущих подряд элемента последовательности". Это значит, что тут парой мы считаем только те элементы, которые идут друг за другом (1-й и 2-й, 2-й и 3-й, 3-й и 4-й...). Поэтому программа будет такая:

## Шаблон
```
with open("17.txt", 'r') as f:
  a=[int(x) for x in f.read().splitlines()] 
#открыли файл и положили число из каждой строчки в массив a 
#(массив работает как переменная с номерными ячейками, обращение к одной из таких ячеек, в нашем случае, - a[номер ячейки])
с = 0
m = 0
for i in range(len(a) - 1):
    for j in range(i + 1, len(a)):
        if #условие:
            s += 1
            m = max(mx, a[i] + a[j])
print(с, m)
```

[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/75a9354c493c21a3da27931b2fb8aae7747945df/templates/ex16-template.py)

### Условие



## Примеры задач
### Задача 1 (4645 на РешуЕГЭ)
***
В файле содержится последовательность из 10 000 натуральных чисел. Каждое число не превышает 10 000. Определите и запишите в ответе сначала количество пар элементов последовательности, у которых различные остатки от деления на d = 160 и хотя бы одно из чисел делится на p = 7, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

Пример входных данных:

168

7

320

328

Пример выходных данных для приведённого выше примера входных данных:

4 488

Пояснение: Из 4 чисел можно составить 6 пар. В данном случае условиям удовлетворяют пары: 168 и 320, 168 и 7, 320 и 7, 328 и 7. Максимальную сумму дает пара 168 и 320 — 488.

***

Решение:
```
with open("17.txt", 'r') as f:
  a=[int(x) for x in f.read().splitlines()] 
с = 0
m = 0
for i in range(len(a) - 1):
    for j in range(i + 1, len(a)):
        if (a[i] % 160 != a[j] % 160) and ((a[i] % 7 == 0) or (a[j] % 7 == 0)):
            с += 1
            m = max(mx, a[i] + a[j])
print(с, m)
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/066697ae0a2d75d216b0e4e543b11e91b93c5f7a/examples/ex16-example.py)

Программа выдаст 309, это и есть ответ.

Ответ: 309


## Примечания
- Не забудтье скачать файл и положить его в одну папку с программой перед тем как запускать программу.
