# Задание №22
Нам дается программа на 5 языках программирования и нужно узнать, например, какое наименьшее число нужно ввести, чтобы получить заданное число. Это задание можно решить и вручную, но переписать его и выполнить на компьютере гораздо проще.
Очень похоже на задание 6, правда? Это так, однако в 22 задании всегда есть некий подвох, который мешает просто применить шаблон без задней мысли и программа зачастую выдает не одно число, а сразу два.

## Задание 22
"Определите, при каком наименьшем введённом значении переменной n программа выведет сначала число X, а потом Y."
## Шаблон
```
for i in range(0,100000):
  # скопировать программу
  # заменить int(input()) на i
  # заменить print(a) print(b) на if a==X and b==Y: print(i) 
```
## Примечания
- Довольно часто программа не работает с обычным диапазоном от 0 до 10000. В таких случаях следует экспериментировать, пробовать диапазон, например, от 1 до 10000 или найти в условии задачи подсказку к диапазону (например, "найдите наибольшее трёхзначное число" говорит о том, что минимальное число - 100, а максимальное - 999)
- В range диапазон пишется специфически! Первый член диапазона включается, а последний нет. Поэтому range(0,10) выставит диапазон [0,10) и проверит числа от 0 до 9 включительно. Учтите это, когда выбираете нужный диапазон!

[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/0f27397acd4e75f9544e7513e306687f83828b12/templates/ex6-template.py)


## Примеры задач
### Задача 1 (7677 на РешуЕГЭ)
***
Получив на вход число x, этот алгоритм печатает два числа a и b. Укажите наименьшее из таких чисел x, при вводе которого алгоритм печатает сначала 2, а потом 13.
***

```
x = int(input())
a, b = 0, 0
while x > 0:
    a = a + 1
    b = b + x%100
    x = x//100
print(a)
print(b)
```

Решение:
```
for i in range(0,10000):
  x = i
  a, b = 0, 0
  while x > 0:
      a = a + 1
      b = b + x%100
      x = x//100
  if a==2 and b==13: print(i)
```
[Ссылка на файл](https://github.com/fagirton/Inf_EGE_templates/blob/42721e34caf021cc28af55110ce88da71076d984/examples/ex6-example.py)

Программа выдаст очень много значений, но нам нужно наименьшее, то есть самое первое - 112

Ответ: 112


## Примечания
- Чтобы не ставить отступы вручную, можно выделить весь текст и нажать Tab. Тогда весь выделенный текст переместится на отступ вправо.

